package util

import (
	"fmt"
	"math/rand"
	"time"
)

var lastName = []string{
	"趙", "錢", "孫", "李", "周", "吳", "鄭", "王", "馮", "陳", "衛", "蔣",
	"沈", "韓", "楊", "朱", "秦", "尤", "許", "何", "呂", "施", "張", "孔", "曹", "嚴", "華", "金", "魏",
	"陶", "姜", "戚", "謝", "鄒", "蘇", "潘", "葛", "範", "彭",
	"魯", "韋", "馬", "苗", "方", "任", "袁", "柳", "史", "唐", "薛",
	"雷", "賀", "倪", "湯", "羅", "顧", "林",
	"黃", "蕭", "姚", "汪", "毛", "戴",
	"宋", "李", "王", "張", "劉", "陳", "楊", "趙", "黃", "周", "吳"}
var firstName = []string{
	"偉", "剛", "勇", "毅", "俊", "峰", "強", "軍", "平", "保", "東", "文", "輝", "力", "明", "永", "健", "世", "廣", "志", "義",
	"興", "良", "海", "山", "仁", "波", "寧", "貴", "福", "生", "龍", "元", "全", "國", "勝", "學", "祥", "才", "发", "武", "新",
	"利", "清", "飛", "彬", "富", "順", "信", "子", "傑", "濤", "昌", "成", "康", "星", "光", "天", "達", "安", "巖", "中", "茂",
	"進", "林", "有", "堅", "和", "彪", "博", "誠", "先", "敬", "震", "振", "壯", "會", "思", "群", "豪", "心", "邦", "承", "樂",
	"紹", "功", "松", "善", "厚", "慶", "磊", "民", "友", "裕", "河", "哲", "江", "超", "浩", "亮", "政", "謙", "亨", "奇", "固",
	"之", "輪", "翰", "朗", "伯", "宏", "言", "若", "鳴", "朋", "斌", "梁", "棟", "維", "啟", "克", "倫", "翔", "旭", "鵬", "澤",
	"晨", "辰", "士", "以", "建", "家", "致", "樹", "炎", "德", "行", "時", "泰", "盛", "雄", "琛", "鈞", "冠", "策", "騰", "楠",
	"榕", "風", "航", "弘", "秀", "娟", "英", "華", "慧", "巧", "美", "娜", "靜", "淑", "惠", "珠", "翠", "雅", "芝", "玉", "萍",
	"紅", "娥", "玲", "芬", "芳", "燕", "彩", "春", "菊", "蘭", "鳳", "潔", "梅", "琳", "素", "雲", "蓮", "真", "環", "雪", "榮",
	"愛", "妹", "霞", "香", "月", "鶯", "媛", "艷", "瑞", "凡", "佳", "嘉", "瓊", "勤", "珍", "貞", "莉", "桂", "娣", "葉", "璧",
	"璐", "婭", "琦", "晶", "妍", "茜", "秋", "珊", "莎", "錦", "黛", "青", "倩", "婷", "姣", "婉", "嫻", "瑾", "穎", "露", "瑤",
	"怡", "嬋", "雁", "蓓", "紈", "儀", "荷", "丹", "蓉", "眉", "君", "琴", "蕊", "薇", "菁", "夢", "嵐", "苑", "婕", "馨", "瑗",
	"琰", "韻", "融", "園", "藝", "詠", "卿", "聰", "瀾", "純", "毓", "悅", "昭", "冰", "爽", "琬", "茗", "羽", "希", "欣", "飄",
	"育", "瀅", "馥", "筠", "柔", "竹", "靄", "凝", "曉", "歡", "霄", "楓", "蕓", "菲", "寒", "伊", "亞", "宜", "可", "姬", "舒",
	"影", "荔", "枝", "麗", "陽", "妮", "寶", "貝", "初", "程", "梵", "罡", "恒", "鴻", "樺", "驊", "劍", "嬌", "紀", "寬", "苛",
	"靈", "瑪", "媚", "琪", "晴", "容", "睿", "爍", "堂", "唯", "威", "韋", "雯", "葦", "萱", "閱", "彥", "宇", "雨", "洋", "忠",
	"宗", "曼", "紫", "逸", "賢", "蝶", "菡", "綠", "藍", "兒", "翠", "煙", "小", "軒"}
var lastNameLen = len(lastName)
var firstNameLen = len(firstName)

//GetFullName 取名字工具
func GetFullName() string {
	rand.Seed(time.Now().UnixNano()) //設置隨機數種子
	var first string
	for i := 0; i <= rand.Intn(1); i++ { //隨機產生2位或者3位的名
		first = fmt.Sprint(firstName[rand.Intn(firstNameLen-1)] + firstName[rand.Intn(firstNameLen-1)])
	}
	//返回姓名
	return fmt.Sprintf("%s%s", fmt.Sprint(lastName[rand.Intn(lastNameLen-1)]), first)
}
